// ============================================================================
// Error strings
// ----------------------------------------------------------------------------
"ERROR_BOOTVOL" = "Deze software moet op het opstartvolume geïnstalleerd worden.";
"ERROR_INSTALL" = "Dit volume voldoet niet aan de eisen voor deze update.";

"Newer_Package_Installed_message" = "Een nieuwere versie van Chameleon is al geïnstalleerd.";
"Intel_Mac_message" = "Deze software kan niet worden geïnstalleerd op deze computer.";


// ============================================================================
// Install Type
// ----------------------------------------------------------------------------
"InstallType_title" = "Installatie Type";
"InstallType_description" = "kies om een nieuwe installatie uit te voeren of een bestaande te vernieuwen.";

"New_title" = "Nieuwe Installatie";
"New_description" = "Archiveer een bestaande /Extra folder, indian aanwezig op de gewezen partitie. Een nieuwe folder zal aangemaakt worden indien een willekeurige optie wordt gekozen, anders dan Bootloader.";

"Upgrade_title" = "Upgrade";
"Upgrade_description" = "Combineer een bestaande /Extra folder, indien aanwezig op de partitie, met een willekeurige optie van de installer, anders dan Bootloader.";


// ============================================================================
// Bootloader
// ----------------------------------------------------------------------------
"Chameleon_title" = "Chameleon";
"Chameleon_description" = "Chameleon heeft drie essentiële bestanden nodig(Simpel gezegd).
boot0 (Op het MBR van de harde schijf) Verantwoordelijke voor het laden van boot1.
boot1 (Op de boot-sector van de partitie) Om boot2 te vinden.
boot2 (In de root van de partitie) Om de kernel, etc. te laden .";

"Standard_title" = "Chameleon Standaard";
"Standard_description" = "Installeer Chameleon";

"EFI_title" = "EFI";
"EFI_description" = "Installeer Chameleon's bestanden naar de verborgen EFI partitie gebruikmakend van boot0 of boot0md afhankelijk van het systeem en zonder het vernietigen van een eventuele windows installatie.";

"noboot_title" = "Geen";
"noboot_description" = "Installeer Chameleon niet. (Bruikbaar om alleen /Extra aan te maken)";


// ============================================================================
// Modules
// ----------------------------------------------------------------------------
"Module_title" = "Modules";
"Module_description" = "The modules system incorporated in chameleon allows for a user or developer to extend the core functionality of chameleon without replacing the main boot file.";

"klibc_title" = "klibc";
"klibc_description" = "Deze module provides a standard c library for modules to link to if the library provided by chameleon is insufficient.
This is currently only used by the uClibc++ library.
Source: http://www.kernel.org/pub/linux/libs/klibc/";

"AutoReso_title" = "Resolution";
"AutoReso_description" = "Deze module leest en past informatie aan van de aangesloten monitors.
Deze module is op moment niet geïntegreerd in de trunk en heeft daarom maar minimale functionaliteit.
Verder past de module de vesa modes aan welke beschikbaar zijn in pre intel hd graphische chipsets om de juiste resolutie tijdens starten weer te geven.";

"uClibc_title" = "uClibc++";
"uClibc_description" = "Deze module geeft minimale c++ runtime library ondersteuning voor gebruik in andere modules.
De functionaliteit is niet ingebouwd in de module, in plaats daarvan wordt het gebruikt om de c++ taal mogelijk te maken in andere modules.
Let op dat rtti en exceptions beiden niet zijn ondersteund.
Bron: http://cxx.uclibc.org/
Afhankelijkheden: klibc";

"Keylayout_title" = "Keylayout";
"Keylayout_description" = "Deze module geeft de gebruiker de mogelijkheid toetsen naar believe in te delen.";


// ============================================================================
// Utility
// These are currently unused!!!
// ----------------------------------------------------------------------------
"Utility_title" = "Hulpprogramma";
"Utility_description" = "Optionele bestanden om te helpen installeren.";

"PrefPanel_title" = "Voorkeuren Paneel";
"PrefPanel_description" = "Installeerd het Voorkeuren Paneel voor Chameleon.";

"SMBIOS_title" = "SMBIOS.plist";
"SMBIOS_description" = "Kopiëert een voorbeeld smbios.plist naar /Extra/Configuration.";

"Documentation_title" = "Documentatie";
"Documentation_description" = "Documentatie voor de handmatige installatie en het gebruik van Chameleon.";


// ============================================================================
// Boot Options - The follow options are split to match the layout OptionalSettings text files.
// but they can be changed to suit however anyone wants to do it.
// ----------------------------------------------------------------------------

"Options_title" = "Opties";
"Options_description" = "Stel standaard opties in";

"BootBanner_title" = "BootBanner=No";
"BootBanner_description" = "Verbergt Chameleon's boot banner in de GUI.";

"GUI_title" = "GUI";
"GUI_description" = "Om de grafische interface uit te zetten, moet er GUI=NO aan com.apple.Boot.plist toegevoegd worden."

"LegacyLogo_title" = "LegacyLogo=Yes";
"LegacyLogo_description" = "Gebruik het standaard logo (grijs op wit) op het bootscherm in plaats van het boot.png logo van het thema.";

"InstantMenu_title" = "InstantMenu=Yes";
"InstantMenu_description" = "Geef het partitie selectie scherm weer, zonder het timeout scherm weer te geven.";

"QuietBoot_title" = "QuietBoot=Yes";
"QuietBoot_description" = "Schakelt quit boot mode in(geen berichten of prompt).";

"ShowInfo_title" = "ShowInfo=Yes";
"ShowInfo_description" = "Schakelt scherm of partitie en resolutie details zoals aangegeven aan de linker zijde van de GUI onder het boot menu. Dit geeft handige informatie voor storing opsporing, maar kan botsen met bepaalde thema's.";

"Wait_title" = "Wait=Yes";
"Wait_description" = "Pauzeert het boot process nadat Chameleon's setup voltooid is, hierna wacht het tot er op een toets gedrukt wordt voor het de mach kernel start. Bruikbaar wanneer het gecombineerd wordt met de verbose boot voor probleemoplossing.";

// ----------------------------------------------------------------------------

"arch_title" = "arch=i386";
"arch_description" = "Boot de kernel in 32bit mode in plaats van de standaard 64bit mode.";

"ForceHPET_title" = "ForceHPET";
"ForceHPET_description" = "Voeg ForceHPET=y toe aan com.apple.Boot.plist, Deze optie zorgt ervoor dat HPET aangezet wordt op intel chipsets en is voor biossen die die optie niet ondersteunen.";

"ForceWake_title" = "ForceWake";
"ForceWake_description" = "Voeg ForceWake=y toe aan com.apple.Boot.plist, deze optie zorgt ervoor dat je corrupte sleep images kan voorbijgaan.";

"EHCIacquire_title" = "EHCIacquire";
"EHCIacquire_description" = "Voeg EHCIacquire=y toe aan com.apple.Boot.plist, Deze optie repareert alle EHCI ownership problemen die worden veroorzaakt door slechte biossen.";

"UHCIreset_title" = "UHCIreset";
"UHCIreset_description" = "Voeg UHCIreset=y toe aan com.apple.Boot.plist, Deze optie zal UHCI controllers resetten voor dat OS X gestart wordt.";

"RestartFix_title" = "RestartFix=No";
"RestartFix_description" = "Schakelt de automatisch ingeschakelde restart fix uit.";

"UHCIreset_title" = "UHCIreset=Yes";
"UHCIreset_description" = "Enables the option to reset UHCI controllers before starting OS X.";

"UseMemDetect_title" = "UseMemDetect=No";
"UseMemDetect_description" = "Schakelt de automatisch ingeschakelde RAM geheugen herkenning uit.";

"UseKernelCache_title" = "UseKernelCache=Yes";
"UseKernelCache_description" = "Alleen voor Lion. Schakelt het laden van pre-linked kernel. Dit negeert /E/E en /S/L/E. Gebruik dit ALLEEN als je weet wat je doet en het alles bevat wat nodig is om te booten.";

"Wake_title" = "Wake=Yes";
"Wake_description" = "Probeert de sleep image te laden die opgeslagen is van de laatste keer dat de pc in hibernatie is gezet.";

// ----------------------------------------------------------------------------

"CSTUsingSystemIO_title" = "Generate C-States=Yes";
"CSTUsingSystemIO_description" = "Nieuww C-State _CST aanmaak methode gebruikmakend van SystemIO registers in plaats van FixedHW.";

"DropSSDT_title" = "DropSSDT=Yes";
"DropSSDT_description" = "Negeert de SSDT tables die ingebouwd zitten in het moederbord.";

"EnableC2State_title" = "EnableC2State=Yes";
"EnableC2State_description" = "Schakelt de Processor stroom staat C2 in.";

"EnableC3State_title" = "EnableC3State=Yes";
"EnableC3State_description" = "Schakelt de Processor stroom staat C3 in.";

"EnableC4State_title" = "EnableC4State=Yes";
"EnableC4State_description" = "Schakelt de Processor stroom staat C4 in.";

"GenerateCStates_title" = "Generate C-States=Yes";
"GenerateCStates_description" = "Schakel automatisch gegenereerde processor C-States in.";

"GeneratePStates_title" = "Generate P-States=Yes";
"GeneratePStates_description" = "Schakel automatisch gegenereerde processor P-States in.";

// ----------------------------------------------------------------------------

"1024x600x32_title" = "1024x600x32";
"1024x600x32_description" = "Zet de grafische resolutie op 1024x600x32";

"1024x768x32_title" = "1024x768x32";
"1024x768x32_description" = "Zet de grafische resolutie op 1024x768x32";

"1280x768x32_title" = "1280x768x32";
"1280x768x32_description" = "Zet de grafische resolutie op 1280x768x32";

"1280x800x32_title" = "1280x800x32";
"1280x800x32_description" = "Zet de grafische resolutie op 1280x800x32";

"1280x1024x32_title" = "1280x1024x32";
"1280x1024x32_description" = "Zet de grafische resolutie op 1280x1024x32";

"1280x960x32_title" = "1280x960x32";
"1280x960x32_description" = "Zet de grafische resolutie op 1280x960x32";

"1440x900x32_title" = "1440x900x32";
"1440x900x32_description" = "Zet de grafische resolutie op 1440x900x32";

"1600x900x32_title" = "1600x900x32";
"1600x900x32_description" = "Zet de grafische resolutie op 1600x900x32";

"1680x1050x32_title" = "1680x1050x32";
"1680x1050x32_description" = "Zet de grafische resolutie op 1680x1050x32";

"1920x1080x32_title" = "1920x1080x32";
"1920x1080x32_description" = "Zet de grafische resolutie op 1920x1080x32";

"1920x1200x32_title" = "1920x1200x32";
"1920x1200x32_description" = "Zet de grafische resolutie op 1920x1200x32";

// ----------------------------------------------------------------------------

"GraphicsEnabler_title" = "GraphicsEnabler=Yes";
"GraphicsEnabler_description" = "Schakelt de optie in om op NVIDIA begaseerde GPU's de detecteren en de correcte info te injecteren.";

"UseAtiROM_title" = "UseAtiROM=Yes";
"UseAtiROM_description" = "Schakelt UseAtiROM opties in.";

"UseNvidiaROM_title" = "UseNvidiaROM=Yes";
"UseNvidiaROM_description" = "Schakelt UseNvidiaROM opties in.";

"VBIOS_title" = "VBIOS=Yes";
"VBIOS_description" = "Schakelt VBIOS optie in.";

// ----------------------------------------------------------------------------
// Boot options - KERNEL FLAGS
// ----------------------------------------------------------------------------

"Verbose_title" = "Verbose Mode";
"Verbose_description" = "Turns on verbose logging and allows you to see messages from both Chameleon and the OS X kernel at boot time. Essential for troubleshooting.";

"Singleusermode_title" = "Single User Mode";
"Singleusermode_description" = "A troubleshooting option used for booting into OS X's BSD/Unix command line.";

"Ignorecaches_title" = "Ignore Caches";
"Ignorecaches_description" = "Not an option that's needed for everyday booting, but it can be useful if you want OS X to load all files from it's system folders, rather than relying on it's pre-built caches.";

"Npci_title" = "npci=0x2000";
"Npci_description" = "For overcoming a hang at 'PCI configuration begin' on some systems. 0x2000 is the kIOPCIConfiguratorPFM64 flag, as seen in the IOPCIFamily source code.";

"Darkwake_title" = "darkwake=0";
"Darkwake_description" = "Lion only. Disables the 'low power wake' feature which can sometimes leave the screen black after wake from sleep.";


// ----------------------------------------------------------------------------
// Boot options - KEYLAYOUTS
// ----------------------------------------------------------------------------

"mac-de_title" = "Duits Mac Keyboard";
"mac-de_description" = "Gebruik de toetsenbord indeling voor een Duits Mac toetsenbord";

"mac-es_title" = "Spaans Mac Keyboard";
"mac-es_description" = "Gebruik de toetsenbord indeling voor een Spaans Mac toetsenbord";

"mac-fr_title" = "Frans Mac Keyboard";
"mac-fr_description" = "Gebruik de toetsenbord indeling voor een Frans Mac toetsenbord";

"mac-it_title" = "Italiaans Mac Keyboard";
"mac-it_description" = "Gebruik de toetsenbord indeling voor een Italiaans Mac toetsenbord";

"mac-se_title" = "Zweeds Mac Keyboard";
"mac-se_description" = "Gebruik de toetsenbord indeling voor een Zweeds Mac toetsenbord";

"pc-fr_title" = "Frans PC Keyboard";
"pc-fr_description" = "Gebruik de toetsenbord indeling voor een Frans PC toetsenbord";


// ----------------------------------------------------------------------------
// Boot options - THEMES
// ----------------------------------------------------------------------------

"Embed_title" = "Embed";
"Embed_description" = "Een kleinere simpele versie van het nieuwe standaard thema dat gebruikt wordt, wanneer er een versie van Chameleon gebouwd wordt die een geëmbed thema nodig heeft.";

"Legacy_title" = "Legacy";
"Legacy_description" = "Chameleon's vorige default thema";

"Default_title" = "Standaard";
"Default_description" = "Het thema wat geëmbed is in de booter, zodat deze aangepast kan worden.";

"Bullet_title" = "Bullet";
"Bullet_description" = "Het Bullet thema door NoSmokingBandit";


// ============================================================================
// The filenames from OptionalSettings text files' become sub menu headings.
// These sub menu headings need titles and descriptions.
// ----------------------------------------------------------------------------
// Control

"Control_title" = "Controle Opties";
"Control_description" = "Opties gerelateerd aan hoe Chameleon werkt.";

// General
"General_title" = "Standaard Opties";
"General_description" = "Kies uit een selectie van standaard opties.";

// KernelFlags
"KernelFlags_title" = "Kernel Vlaggen";
"KernelFlags_description" = "Kies uit een selectie aan kernel vlaggen.";

// PowerManagement
"PowerManagement_title" = "Stroom Beheer";
"PowerManagement_description" = "Een selectie aan opties welke stroom beheer en snelheidstrappen regelen.";

// Resolution
"Resolution_title" = "Resolutie";
"Resolution_description" = "Set one resolution to use.";

// Video
"Video_title" = "Beeld";
"Video_description" = "Een selectie aan opties welke te maken hebben met beeld.";

// KeyLayout
"KeyLayout_title" = "Toetsenbord Indeling";
"KeyLayout_description" = "Select one keylayout to use. This will also install the Keylayout module and keymaps.";

// Themes
"Themes_title" = "Thema's";
"Themes_description" = "Een Collectie van Voorbeeld Thema's
Meer thema's kunnen worden gevonden op http://forum.voodooprojects.org/index.php/board,7.0.html";


// ============================================================================
// Exclusive boot options string - These are added automatically by buildpkg
// Name to be used should be ChooseNone-xxxxxx
// Where xxxxx = the name of the BootOptions file (minus the .txt)
// ----------------------------------------------------------------------------
"ChooseNone-Resolution_title" = "Geen";
"ChooseNone-Resolution_description" = "Kies geen resolutie.";

"ChooseNone-keylayout_title" = "Geen";
"ChooseNone-keylayout_description" = "Gebruik geen keyboardindeling.";
